exampleCases/example.2.piso.NREL5MW.ALMAdvanced/constant/turbineArrayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

globalProperties
{
    outputControl       "timeStep";
//  outputControl       "runTime";
    outputInterval       1;
}


turbine0
{
    turbineType                      "NREL5MWRef";
    includeNacelle                    true;
    includeTower                      true;
    baseLocation                     (500.0 500.0 0.0);
    numBladePoints                    40;
    numNacellePoints                  10;
    numTowerPoints                    40;
    bladePointDistType               "uniform";
    nacellePointDistType             "uniform";
    towerPointDistType               "uniform";
    bladeSearchCellMethod            "disk";
    bladeActuatorPointInterpType     "integral";
    nacelleActuatorPointInterpType   "linear";
    towerActuatorPointInterpType     "linear";
    actuatorUpdateType               "oldPosition";
    bladeForceProjectionType         "uniformGaussian";
    nacelleForceProjectionType       "diskGaussian";
    towerForceProjectionType         "advanced";
    bladeForceProjectionDirection    "localVelocityAligned";
    velocityDragCorrType              "none";
    bladeEpsilon                     (20.01 0.0 0.0);
    nacelleEpsilon                   (20.0 20.0 0.0);
    towerEpsilon                     (20.0 20.0 0.0);
    nacelleSampleDistance             1.0;
    towerSampleDistance               3.5;
    forceScalar                       1.0;
    tipRootLossCorrType              "Glauert";
    rotationDir                      "cw";
    Azimuth                           0.0;
    RotSpeed                          9.1552;
    TorqueGen                         0.0;
    Pitch                             0.0;
    NacYaw                          270.0;
    fluidDensity                      1.23;
}

turbine1
{
    turbineType                      "NREL5MWRef";
    includeNacelle                    true;
    includeTower                      true;
    baseLocation                     (1000.0 500.0 0.0);
    numBladePoints                    40;
    numNacellePoints                  10;
    numTowerPoints                    40;
    bladePointDistType               "uniform";
    nacellePointDistType             "uniform";
    towerPointDistType               "uniform";
    bladeSearchCellMethod            "disk";
    bladeActuatorPointInterpType     "integral";
    nacelleActuatorPointInterpType   "linear";
    towerActuatorPointInterpType     "linear";
    actuatorUpdateType               "oldPosition";
    bladeForceProjectionType         "uniformGaussian";
    nacelleForceProjectionType       "diskGaussian";
    towerForceProjectionType         "advanced";
    bladeForceProjectionDirection    "localVelocityAligned";
    velocityDragCorrType              "none";
    bladeEpsilon                     (20.01 0.0 0.0);
    nacelleEpsilon                   (20.0 20.0 0.0);
    towerEpsilon                     (20.0 20.0 0.0);
    nacelleSampleDistance             1.0;
    towerSampleDistance               3.5;
    forceScalar                       1.0;
    tipRootLossCorrType              "Glauert";
    rotationDir                      "cw";
    Azimuth                           0.0;
    RotSpeed                          9.1552;
    TorqueGen                         0.0;
    Pitch                             0.0;
    NacYaw                          270.0;
    fluidDensity                      1.23;
}